app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (G)  ORDER BY title asc
SELECT "movies".* FROM "movies" WHERE (PG-13)  ORDER BY release_date asc
SELECT "movies".* FROM "movies"
---
    def index

      #select method returns an ActiveRecord::Relation object
      #@all_ratings = Movie.select(:rating).map(&:rating).uniq
      @all_ratings = Movie.all_ratings

      sort = params[:sort]

      if sort == 'title'
        @movies = Movie.order('title asc')
        @header_title_highlight = 'bg-warning hilite'
      elsif sort == 'release_date'
        @movies = Movie.order('release_date asc')
        @header_release_highlight = 'bg-warning hilite'
      else
        @movies = Movie.all